import { Card, Col, Row } from "react-bootstrap";
import "../styles/style.css";
import CarouselMain from "../components/CarouselMain";
export default function InfoMainPage() {
  return (
    <>
      <div className="carousel-container">
        <CarouselMain />
      </div>
      <Row
        xs={1}
        md={2}
        className="gx-4 gy-4 justify-content-center"
        style={{ margin: "30px 120px 30px 120px" }}
      >
        <Col xs={12} md={6} lg={4}>
          <Card className="h-100 colorful-card">
            <Card.Body>
              <Card.Title>Какво е Полиурея (Polyurea)</Card.Title>
              <Card.Text className="text-muted">
                Продуктите от полиурея са високосъдържащи бои и покрития,
                формулирани от полиуретанови еластомерни смоли. Поради техните
                напреднали свойства, продуктите от полиурея имат важни
                приложения в строителството, индустрията, морската промишленост,
                транспорта и отбраната.
              </Card.Text>
            </Card.Body>
          </Card>
        </Col>

        <Col key={1} className="image-col">
          <img
            src="images/info-image.png"
            alt="Information Image"
            className="info-image"
          />
        </Col>
      </Row>

      <Row
        xs={1}
        md={2}
        className="g-4"
        style={{ margin: "30px 120px 30px 120px" }}
      >
        <Col key={0}>
          <Card style={{ margin: "21px" }}>
            <Card.Body>
              <Card.Title>100% Чиста Полиурея</Card.Title>
              <Card.Text style={{ borderTop: "solid 1px grey" }}>
                100% чиста полиурея, чиста в компонент А полиолов компонент и
                формулирана от разнообразие от аминни смоли с висока степен на
                еластичност и твърдост. Освен високата си механична и динамична
                здравина и химическа устойчивост, тя разполага и с по-здрава
                структура.
              </Card.Text>
            </Card.Body>
          </Card>
        </Col>

        <Col key={1}>
          <Card style={{ margin: "21px" }}>
            <Card.Body>
              <Card.Title>Хибридна Полиурея</Card.Title>
              <Card.Text style={{ borderTop: "solid 1px grey" }}>
                Хибридната полиурея от компонент А е формулирана от чисти и
                разнообразни аминни смоли в полиоловия компонент и разполага с
                идеално ниво на гъвкавост и твърдост. Препоръчва се използването
                на този продукт основно за изолационни и покривни работи.
              </Card.Text>
            </Card.Body>
          </Card>
        </Col>

        <Col key={2}>
          <Card style={{ margin: "21px" }}>
            <Card.Body>
              <Card.Title>Полиурея за под</Card.Title>
              <Card.Text style={{ borderTop: "solid 1px grey" }}>
                Продуктът за подова полиурея е изключително нисковискозитен
                покритиен продукт, разработен за покриване на подове с
                интензивен автомобилен и пешеходен трафик или различни материали
                поради своята твърдост и здрава структура, като резултат от
                реакцията.
              </Card.Text>
            </Card.Body>
          </Card>
        </Col>

        <Col key={3}>
          <Card style={{ margin: "21px" }}>
            <Card.Body>
              <Card.Title>Течни полиуреи</Card.Title>
              <Card.Text style={{ borderTop: "solid 1px grey" }}>
                Произвежда се с предпочитани качества за хидроизолация, мастило
                и грундови продукти, които могат да се прилагат чрез нанасяне
                или изливане, разработени с различни формулации на течна (течна)
                полиурея амин и изоцианатни съотношения.
              </Card.Text>
            </Card.Body>
          </Card>
        </Col>
      </Row>
      <div
        className="info-container"
        style={{ margin: "30px 180px 30px 180px" }}
      >
        <h2>Polyurea</h2>
        <p>
          Polyurea е получен чрез смесване на компонент A - ароматен TDI
          преполимер (толуендиизоцианат) и компонент B - полиамин-терминирана
          смола в съотношение 1-1 с помощта на високонапорни машини в обхват от
          70-80 градуса и смесване в края на камерата за смесване. Polyurea може
          да бъде получена в много формулации. Те се разделят на широко на два
          класа; хибридни аминно-базирани и чисти аминно-базирани полиуреи.
          Чиста полиуреа; в формулите на смолите се добавят компонент B -
          полиамин, различни добавки за повишаване на силата; се получават
          полиуреи с висока здравина. Хибридна полиуреа; Компонент A - полиамин
          е икономичен в резултат на икономическото предпочитане на аминни смоли
          по време на производството на смола; освен това може да има вариации
          във физическите свойства и ниска химическа устойчивост. Чистата и
          хибридната полиуреа могат да бъдат формирани едновременно, като се
          използва както алифатичен, така и ароматичен TDI преполимер. Като
          стандарт всички производители използват ароматичен TDI преполимер като
          отвърдител. Алифатичният TDI преполимер не се предпочита поради
          високите разходи и липсата на пазарно търсене. Polyurea бързо се стяга
          след разпръскване на своите компоненти; сгъстява се в средно време от
          5 секунди, може да се докосне след една минута и може да бъде отворен
          за пешеходен трафик след няколко минути. Освен това, polyurea предлага
          отлично съпротивление поради своята физическа структура. С високата си
          механична здравина създава повърхност за покритие, подходяща за
          автомобилен трафик. Днес полиуреата се предпочита в различни сектори.
          Строителният сектор, морският сектор, отбранителният сектор и
          индустриалният сектор са сред тях. Polyurea може да бъде получена в
          много формулации. Те се разделят на широко на два класа; хибридни
          аминно-базирани и чисти аминно-базирани полиуреи.Нанесете
          двукомпонентен, без разтворители, 100% чист епоксиден грунд средно с
          250 г/м2 на почистените повърхности с помощта на валяк или подобен
          материал. Преди да изсъхне грундът, насипете кремен пясък (с дебелина
          0,7-1,0 мм) върху повърхността, за да я нашлаковате. Преди да
          започнете разпръскването, закрепете повърхности, обекти, конструкции и
          др., които трябва да бъдат защитени от изолацията, и пригответе
          повърхността за разпръскване. След като грундът, нанесен на
          повърхността, изсъхне напълно, нанесете разпръскана полиуреа върху
          повърхността. Двукомпонентният разпръскан материал на полиуреата,
          който ще се използва, на база изоцианат (компонент A) и полиетерамин
          (компонент B), трябва да се нанася чрез разпръскване със специална
          разпръскваща машина, която не съдържа летливи органични съединения,
          има минимална гъвкавост от 400%, минимално налягане от 2500 psi и
          минимална температура от 80°C. Времето за изсъхване (време за
          сгъстяване) на материала трябва да бъде максимум 10 секунди, а времето
          за отваряне за пешеходен трафик трябва да бъде максимум 120 секунди.
          Дебелината на полиуреата, която ще се нанася, трябва да е минимум 2,00
          мм (2 кг/м2). Трябва да се обърне специално внимание на ставите и
          критичните детайли, без да се оставят празнини, пори и др. Материалът
          трябва да отговаря на стандартите по отношение на теглото при
          разтегливост, съпротивлението на разкъсване, твърдостта, гъвкавостта,
          износването, вискозитета и физическите свойства. Техническите
          спецификации за материала са дадени по-долу. Материалът трябва да
          разполага със свойства за бързо изсъхване. Той трябва да може да се
          прилага в ниски или много високи температурни условия. Трябва да е
          устойчив на физически ефекти като износване и триене и напълно
          устойчив на киселини и алкали с pH от 3 до 11. Технически
          спецификации: Много бързо изсъхва. Време за сгъстяване: 3 секунди,
          Време за докосване: 18 секунди, Превишено време: 10 минути. Поради
          своята химична структура той разполага с много добра температурна
          стабилност при високи температури. Той разполага с широк диапазон на
          приложение по отношение на температурата и може да бъде произведен
          дори при -20°C. За разлика от детайлите на мембраната, той създава
          безшевна изолационна система.
        </p>
      </div>
    </>
  );
}
